[
    {
        "id": "palwankar-baloo",
        "title": "Spin, Struggle and Triumph: The Story of Palwankar Baloo",
        "author": "Lakshit Singhal",
        "date": "Mar 29",
        "readTime": "3 min read",
        "category": "History",
        "coverColor": "bg-emerald-900",
        "spineColor": "bg-emerald-950",
        "textColor": "text-[#f0e6d2]",
        "coverImage": "https://static.wixstatic.com/media/b4de10_e3dd86c9cbc24874bcaab60891f96dc3~mv2.jpeg/v1/fill/w_500,h_769,al_c,q_85/b4de10_e3dd86c9cbc24874bcaab60891f96dc3~mv2.jpeg",
        "content": "The story begins in 1875. Baloo was born in Dharwad but shifted to Poona after his father took up a job there. He used to sweep and roll the pitch in a Parsi club for a measly Rs 3 per month. He then took a job in the Poona Club where his salary increased to Rs 4 per month. Here he used to roll and mark the pitch, erect the nets and bowl to cricketers at the Club.\n\nAt the Poona Club, Baloo got introduced to Captain Barton. A slow left-arm spinner, known for his accuracy. Barton became Baloo's mentor. Baloo used to bowl to other members of the club regularly where he built his fitness and developed his skillset. Poona club's captain, J.G. Grieg, famously known as Jungly, got to know about Baloo's bowling prowess and he started using his services to hone his skills and prepare for matches.\n\nJungly used to come to the Club an hour before everybody else and ask Baloo to bowl to him. He also used to give him 8 annas for every time he got him out. Hours of toiling in the nets made Baloo an even better and efficient bowler. Before he knew it, the news of Palwankar’s abilities reached the native clubs and cricketers.\n\nA local Hindu club who was looking to challenge the European team in Poona wanted his services. But were in a dilemma due to his caste and social status. Jungly came in to help Baloo. He praised his bowling skills in an interview which made the Hindu club to play him in the team.\n\nHis bowling helped Hindus defeat the Europeans. Baloo's bowling prowess was such that even English batters feared him. In a match in Satara, they had prepared the wicket to nullify Palwankar’s spin. He still took 7 wickets and helped his team win the match. After his electrifying performance, he was paraded on an elephant. When he returned to Poona, he was felicitated by Mahadev Govind Ranade and was honoured by Bal Gangadhar Tilak at a public event.\n\nWhile he was treated equally on the field, outside the field he was given a different behavior. He was served tea in a clay matka outside the pavilion while his teammates drank tea in porcelain cups inside the pavilion. He had to wash his hands and face with the help of an untouchable servant in one corner of a field. He used to eat lunch on a separate plate and on a separate table.\n\nBaloo then made another shift. This time to Bombay. He did so for two main reasons - the Poona plague of 1896 and better cricket opportunities. He was recruited by the famous Parmanandas Jivandas Hindu Gymkhana. Once deemed untouchable, Baloo had turned the tide through his exploits as a slow left-arm spinner. M.E. Pavri, a pioneer of Parsi cricket and Baloo's opponent, praised him as one the best native bowlers and the Wilfred Rhodes of India.\n\nBaloo was not only the preference of local clubs but also the Maharajas. In one instance, the Maharaja of Natore had invited him to play in a match against the Maharaja of Jodhpur's team. The latter had Ranji playing for them. But Baloo got the better of him and dismissed him for just 20 runs. Ranji and Baloo had gone against each other previously as well in a match between Kathiawad and Zaalawad. Zaalawad managed to defeat Kathiawad with Baloo picking up the wicket of Ranji.\n\nAn all-India team toured England in 1911. The team played a total of 14 matches out of which they won 2, lost 10 and drew 2. Baloo amassed 114 wickets on the tour. Not only that, he picked up 5 wickets for 7 runs against Oxford, 4 wickets for 96 against the MCC and 8 wickets for 103 runs against Cambridge. What makes this performance even more remarkable is the fact that he was suffering from swelling on his shoulder.\n\nFamous English critic E.H.D. Sewell praised Baloo. He said that his performance was exceptional and he would be the first choice of any county team. Baloo was facilitated at an event where the welcome address was delivered by none other than B.R. Ambedkar. In 16 matches that Baloo played across the Bombay Quadrangular, Triangular and Presidency matches, he took 109 wickets, while also scoring 410 runs.\n\nBaloo passed away on July 4, 1955, leaving behind a legacy as India's first great cricketer. At a time when cricket was being played on communal lines, Baloo was breaking social barriers through his performance on the field."
    },
    {
        "id": "no-ball-strike",
        "title": "No Ball!: How A Strike Almost Silenced England Cricket",
        "author": "Lakshit Singhal",
        "date": "Mar 2",
        "readTime": "2 min read",
        "category": "History",
        "coverColor": "bg-amber-900",
        "spineColor": "bg-amber-950",
        "textColor": "text-amber-50",
        "coverImage": "https://static.wixstatic.com/media/b4de10_df0d36c2e3d344a1b02324647343e0d6~mv2.jpeg/v1/fill/w_500,h_395,al_c,q_80,usm_0.66_1.00_0.01,enc_auto/b4de10_df0d36c2e3d344a1b02324647343e0d6~mv2.jpeg",
        "content": "In the early 20th century, cricket was an integral part of British culture, with the sport being deeply ingrained in the fabric of English life. However, just before the outbreak of World War I, a significant event threatened to disrupt this beloved pastime: a strike by cricket ball manufacturers in Kent.\n\nFor over 150 years, Kent had been renowned for producing high-quality cricket balls, with firms like Dukes and Alfred Reader leading the industry. These balls were not only used domestically but also exported to countries like Australia and India.\n\nIn the April of 1914, cricket ball makers in Tonbridge, Kent, went on strike, demanding a wage increase of five shillings per dozen balls. The workers, who were considered highly skilled, earned only about 30 shillings per week, a wage that was deemed insufficient by the workers.\n\nThe strike was led by the Amalgamated Society of Cricket Ball Makers, a union that played a crucial role in advocating for workers' rights in the industry.\n\nThe strike garnered considerable attention from both the public and media, with many sympathetic to the workers' cause. Editorials in major newspapers supported the strikers, emphasizing cricket's popularity and urging for a resolution to avoid disruption during the summer months.\n\nAfter several weeks, an agreement was reached between the union and the manufacturers, averting a potential cancellation of the cricket season. However, this resolution was short-lived, as the outbreak of World War I in August 1914 led to a halt in first-class cricket across England, Australia, and other nations involved in the conflict.\n\nAfter the war, the Amalgamated Society of Cricket Ball Makers continued to advocate for workers' rights. But the industry began to decline as manufacturing moved to lower-wage countries like India and Pakistan. Strikes continued to occur, such as in 1930 and 1953, but the industry's heyday was coming to an end."
    },
    {
        "id": "mankad-test-one-of-a-kind",
        "title": "Mankad's Test: One Of A Kind",
        "author": "Lakshit Singhal",
        "date": "Feb 22",
        "readTime": "3 min read",
        "category": "History",
        "coverColor": "bg-indigo-900",
        "spineColor": "bg-indigo-950",
        "textColor": "text-indigo-50",
        "coverImage": "https://static.wixstatic.com/media/b4de10_8d975cac6c5e4c85b1c97a9f73f71c36~mv2.jpeg/v1/fill/w_500,h_769,al_c,q_85,usm_0.66_1.00_0.01,enc_auto/b4de10_8d975cac6c5e4c85b1c97a9f73f71c36~mv2.jpeg",
        "content": "It had been 20 years since India made its Test debut in 1932 but the dream of winning their first match was far from achieved. This, however, changed in 1951-1952 when England toured India for a five test series. The first three tests ended in a draw and the English reigned supreme in the fourth test at Kanpur. The final test at Madras got etched in cricket folklore as the hosts decimated the English by an innings and eight runs to register their maiden Test win.\n\nA certain Mulvantrai Himmat Lal Mankad, popularly known by his nickname Vinoo, picked up 12 wickets and was the chief architect of this famous victory. A shrewd and thinking bowler, Mankad was a master in deceiving the batter through flight and variations. In a thundering all-rounded performance, he picked up 34 scalps and amassed 223 runs in the series, justifying his position of being a world-beating all-rounder. His fortunes were however going to change in the coming months.\n\nIndia was to tour the land of former colonizers in the summer of 1952, not an easy assignment by any means. A player of Mankad's reputation was a certainty in the squad, given his stupendous performance in the previous tour of 1946. Or so he thought. When the trials of the English tour were being conducted in India, Mankad was in England and had received a lucrative contract from Haslingden club to play in the Lancashire League.\n\nIn such circumstances, Mankad demanded an assurance from the BCCI that he would be guaranteed selection in all tests if he goes on to rescind his contract with the Haslingden Club. His request was left unheeded and Mankad signed the deal with Haslingden. The Board and the selection committee were left furious and chose not to include Mankad in the side, decreeing that India can produce a dozen spinners like him. Hence began the infamous chapter in the history of player-board conflict in Indian cricket history.\n\nVinoo’s absence was desperately felt in the Vijay Hazare-led side. In the first test, the fearsome duo of Alec Bedser and Fred Trueman baffled the Indian batters, reducing them to 0-4 in the second innings and handing the visitors a seven-wicket defeat. The humiliating loss and player injuries prompted the Indian captain and manager Pankaj Gupta to request the Haslingden Club to release Mankad.\n\nThe club was initially hesitant but later agreed to release Mankad for the rest of the series on the insistence of Sir Herbert Merrett, a Welsh businessman and the President of the Glamorgan County Cricket Club. Consequently, Mankad was included in the Indian side for the second Test at Lord’s, reportedly against the wishes of the BCCI.\n\nMankad unleashed his magic, scoring a gritty 72 in the first innings and a majestic 184 out of team’s total of 378 in the second innings. He complimented it with a five-wicket haul in the first innings. His display of skill and character was so superlative that the test came to be famously known as 'Mankad's Test', only the one of it's kind in world cricket. Life came full circle for Vinoo Mankad who made his debut at the same venue six years ago.\n\nHowever, his inclusion and solid performances could not change the fortunes of the team as India lost the test and also the series. Mankad continued to shine for the Haslingden Club. The treatment accorded to him by his own Board left him saddened and demoralized. But he continued to play a crucial role in the Indian team in years to come, carving a legacy of his own."
    },
    {
        "id": "review-the-one-by-shikhar-dhawan",
        "title": "Review: The One by Shikhar Dhawan",
        "author": "Lakshit Singhal",
        "date": "Nov 19",
        "readTime": "2 min read",
        "category": "Book Review",
        "coverColor": "bg-red-900",
        "spineColor": "bg-red-950",
        "textColor": "text-red-50",
        "coverImage": "https://static.wixstatic.com/media/b4de10_92f03f5ad41a4a49bc704b6b158021b0~mv2.png/v1/fill/w_500,h_769,al_c,q_85,usm_0.66_1.00_0.01,enc_auto/b4de10_92f03f5ad41a4a49bc704b6b158021b0~mv2.png",
        "content": "The One follows the archaic and tired formula of an autobiography - childhood, journey into a prominent cricketer, addressing the controversies surface-level and ending with retirement and after-career life.\n\nThis trap is difficult to avoid. But is it really that hard? Ashwin did it with aplomb in “I have the Streets”. Anderson somewhat managed to do it in ‘Finding the Edge’. It is always exciting to meet the human behind the cricketer but the narrative needs to be interesting enough to make the reader a part of the world. Sadly, that doesn't happen here.\n\nTalking about positives, Dhawan is honest. He lays bare his personality, accepts the mistakes he has made and puts forward his point of view in a lucid manner. The West Delhi references were relatable, as I come from the same part of the city. I was amazed by how secure Dhawan is both as a cricketer and person.\n\nFrom a reading point, it's an easy read. The prose is underwhelming but reflective. Dhawan talks about his struggles, highs and lows, friendships and experience with different coaches and captains he played with and under. Between Gary Kirsten and Ravi Shastri, Indian cricket fans sometimes fail to acknowledge Duncan Fletcher’s contribution as a coach during the transition phase in 2013-14 but Dhawan gives Daddu (as the team fondly called him) the appreciation where it is due.\n\nHe also shares an extremely funny incident involving Sachin Tendulkar which had me in splits. Some of the chapters are meant to explain Dhawan’s personality and they do a good job. Dhawan addresses the controversial moments but only with caution and without passing any judgements.\n\nWhich brings me back to my observation that The One lacks depth and details. The linear narrative couldn’t hold my attention for long. Co-written by Chandresh Narayanan and Namita Kala, the book explores Dhawan’s life only on the surface without delving deep into any aspect.\n\nDhawan was a terrific performer for India in the ICC tournaments. Not just great, he scored 363 runs in the 2013 edition and 338 runs in the 2017 edition of the Champions Trophy, finishing as the leading run-scorer in both the events. He was also the leading scorer in the 2015 World Cup having scored 412 runs. I was looking forward to reading more about his approach, preparation and performance in these tournaments, rather than just numbers. His glittering white-ball career deserved a more structured presentation but the depth was lacking.\n\nVerdict:\nThe memoir has valuable lessons for the upcoming cricketers. Some important life-lessons too for the regular readers. Apart from that, the book is strictly for Shikhar Dhawan fans who are looking to know about his life.\n\nRating: 2.5 Stars"
    },
    {
        "id": "review-gully-gully",
        "title": "Review: Gully Gully",
        "author": "Lakshit Singhal",
        "date": "Nov 6",
        "readTime": "2 min read",
        "category": "Book Review",
        "coverColor": "bg-blue-900",
        "spineColor": "bg-blue-950",
        "textColor": "text-blue-50",
        "coverImage": "https://static.wixstatic.com/media/b4de10_018255d68d184a44b9840c95811fb62f~mv2.jpeg/v1/fill/w_500,h_769,al_c,q_85,usm_0.66_1.00_0.01,enc_auto/b4de10_018255d68d184a44b9840c95811fb62f~mv2.jpeg",
        "content": "One of my favourite books on cricket is Eye on Cricket. I have recommended it to my friends, cricket fans and even non-cricket fans. The book has a dedicated chapter on cricket writing where Samir Chopra writes:\n\n'I agree. Cricket writing has become boring and unimaginative. A biography or an autobiography spells out records and statistics like it has been given a command from an AI bot. The phrases find repeated and cliched use in cricket writings, even from the most proficient writers. Gully Gully breaks this clutter.'\n\nThe writing is fresh, sometimes poetic. Iyer delivers an entertaining prose. Cricket becomes the vehicle to travel the country and he takes the reader on a joyous and enthralling ride. Every city that hosted an India game becomes a character. From Lucknow’s food to Chennai’s weather, each chapter is filled with anecdotes and stories that are worth savoring.\n\nAnd so do the stadiums. The vivid descriptions of the murals, entrances and the media boxes make you feel you are at the stadium, experiencing it all.\n\nI could also relate to the Kohli jumping into Bhangra during the New Zealand game in Dharamshala, which I happened to watch LIVE from the stands. Despite the ticket mismanagement that saw cricket fans waiting in queues forever, I managed to get my hands on tickets for a couple of games. The book helped me revisit those beautiful six weeks of 2023.\n\nThe narrative involves Iyer collaborating with a cricket personality for each chapter. And not just cricketers. There are journalists, fans, retired cricketers and even administrators. This is the part that brings a unique perspective to the book and enhances the storytelling.\n\nIyer doesn’t shy away from being critical. He calls out the shambolic preparations, ugly and incomplete stadiums and uncivilized crowd behaviour. There is also an unbiasedness and objectivity in the manner in which he writes about the cricketers.\n\nAs a writer, Gully Gully inspires me to express myself in the most unfiltered yet restrained manner. There is a thin line between the two and writing in general excels when\n\nWriting a travelogue is painstaking. There is too much to plan, prepare and execute. We desperately need more writers who can bring candidness and originality to cricket writing. Who can move away from the bondages of cliches.\n\nVerdict: Gully Gully has successfully carved out its own place among the vast library of cricket literature.\n\nRating: 4/5"
    },
    {
        "id": "blood-and-bones-marshall",
        "title": "Blood and Bones - The Marshall 'Perfume' Ball",
        "author": "Lakshit Singhal",
        "date": "Feb 19",
        "readTime": "2 min read",
        "category": "History",
        "coverColor": "bg-rose-900",
        "spineColor": "bg-rose-950",
        "textColor": "text-rose-50",
        "coverImage": "https://static.wixstatic.com/media/b4de10_8bbaf86f071e4999902cd4507e2894a2~mv2.png/v1/fill/w_500,h_769,al_c,q_85,usm_0.66_1.00_0.01,enc_auto/b4de10_8bbaf86f071e4999902cd4507e2894a2~mv2.png",
        "content": "On February 18, 1986, a moment of cricketing infamy unfolded during the first ODI between England and the West Indies at Sabina Park, Kingston.\nEngland, touring the Caribbean, faced an uphill battle against a West Indies side that hadn't lost a Test series in over a decade.The West Indies boasted of a bowling unit consisting of Marshall, Courtney Walsh, and Joel Garner.\nIn the opening ODI, England batted first but found themselves in dire straits early on, losing two wickets for just 10 runs. Captain Viv Richards, sensing the threat posed by Gatting and his partner Graham Gooch, instructed Marshall to bowl what is infamously known as the \"perfume ball.\" This term refers to a delivery that comes so close to the batsman's face that he can almost \"smell\" the leather of the ball.\nMarshall executed this delivery with precision. As Gatting attempted to hook the short ball, it lifted unexpectedly and smashed into the bridge of the nose. The impact was catastrophic; blood gushed from his injury as he fell to the ground. To add insult to injury, the ball ricocheted off his face and knocked over the stumps.\nWitnesses described the scene as harrowing. Gatting's injury was so severe that a piece of bone from his nose was later discovered lodged in the ball when it was returned to Marshall. England's physio Laurie Brown at the time remarked \"It is the worst injury I have ever seen in all my years working with footballers and cricketers”.\nMarshall later recounted how he felt queasy upon discovering bone fragments in the ball, indicating just how brutal this encounter had been. The injury was so severe that Gatting was forced to return to England for specialized treatment.\nGatting's injury became one of cricket's most talked-about moments, leading to discussions about player safety and equipment standards. His nose remains famously known as \"the most photographed nose in Britain,\" symbolizing both the brutality of fast bowling and the resilience required in professional sports."
    },
    {
        "id": "bedi-vaseline-affair",
        "title": "Bedi's Act of Revolt: The Vaseline Affair",
        "author": "Lakshit Singhal",
        "date": "Feb 15",
        "readTime": "3 min read",
        "category": "History",
        "coverColor": "bg-cyan-900",
        "spineColor": "bg-cyan-950",
        "textColor": "text-cyan-50",
        "coverImage": "https://static.wixstatic.com/media/b4de10_213adc7db45443baac050777480bb3f6~mv2.jpeg/v1/fill/w_1000,h_757,al_c,q_85,usm_0.66_1.00_0.01/b4de10_213adc7db45443baac050777480bb3f6~mv2.jpeg",
        "content": "The year is 1976. Bishan Singh Bedi was leading India for a four-match test series against the West Indies. The third test saw India decimating the hosts as they completed a record fourth innings chase of 406, riding on centuries from Gundappa Vishwanath and Sunil Gavaskar. Michael Holding was infuriated and would not have any of it.\nThe decider at Kingston marked the return of an all pace attack by the West Indies, deploying intimidating short-pitched bowling at the body of the Indian batters, even as the umpires stood still like a rock. The furious Bedi surrendered the test in protest. He felt that the hosts’ tactics were against the spirit of the game. This was the beginning of the many anti-authoritative and principled stands taken by Bedi, also the reason behind the infamous ‘Vaseline Affair’.\nLater that year, the Tony Greig-led English side toured India and were scheduled to play five tests across the country. The first match in Delhi marked the Test debut for the 27-year-old Essex bowler John Lever. He didn’t have the faintest idea of what the series had in store for him. Lever started off majestically, picking up 7 for 46 and 3 for 24 in first and second innings respectively. England were proving to be a tough proposition for the hosts as they cruised to easy victories in the first two tests.\nThe action moved to Madras. On a surface which Wisden termed as \"one of the fastest produced in India for years\", Indian bowlers were treated with disdain as England piled up 262 in the first innings. The left-arm medium fast bowler ferociously swung the ball and picked up 5 for 59 and India collapsed for a meagre 164.\nBut something strange caught the attention of the umpires before the Indian innings came to a close. Judah Reuben found a sticky gauze strip lying on the bowler’s run up. He discussed it with his fellow umpire, MS Sivasankariah and then brought it to the notice of respective captains.\nGreig clarified that those were Vaseline strips, used by bowlers to prevent sweat from entering into their eyes. The weather in Madras is known to be extremely hot and humid. Almost comparable to a furnace. Willis and Lever were advised by the English team physio to stick Vaseline-impregnated gauzes on the forehead to avoid the trouble. But the strips kept slipping down. Also, sweat mixed with Vaseline made it difficult for the duo to grip the ball and hence they discarded the strips, which were then found by the umpire.\nThe umpires accused Lever of ball-tampering - the first of the many instances in international cricket. Bedi was quick in calling out Lever and Willis for “stooping so low”. He went so far ahead to remark that the ball was tampered with even in the Delhi Test, which was the reason for Lever’s excess swing. The umpires informed the BCCI and the match ball along with the gauze strip were sent for forensic analysis. In no time, the incident had taken the form of a major scandal.\nThe results affirmed the presence of Vaseline on the strips and also on the ball. The news spread like wildfire and the crowd at the stadium raised slogans in protest. Tony Greig, on the other hand, stood his ground that the act was not deliberate and criticized Bedi stating that “his disappointments in this series have clouded his judgement.\"\nThe BCCI failed to come to a conclusion and referred the matter to the MCC in London, who accepted the reasoning given by Greig and the English team physio and put the controversy to rest. To add salt on the wounds, India lost that particular Test. Though the hosts managed to win the fourth test at Chinnaswamy and draw the final Test in Mumbai, the horrendous 3-1 crushing could not be avoided. Lever had a remarkable tour as he picked up 26 wickets at an average of 14.61 and strike rate of 34.5.\nThe aftermath of the controversy was not pleasant for the Indian skipper. The incident drew diverse opinions worldwide, some even calling out Bedi for using the incident as a cover-up for his poor performances. Bedi criticized the BCCI for not supporting him enough and faced repercussions for the same."
    },
    {
        "id": "tales-of-spin-warne",
        "title": "Tales of Spin - The Forgotten Legacy of Shane Warne",
        "author": "Lakshit Singhal",
        "date": "Feb 15",
        "readTime": "3 min read",
        "category": "History",
        "coverColor": "bg-lime-900",
        "spineColor": "bg-lime-950",
        "textColor": "text-lime-50",
        "coverImage": "https://static.wixstatic.com/media/b4de10_e9046af4a94b4fe6b05bea2c7bbff320~mv2.webp/v1/fill/w_1000,h_648,al_c,q_85,usm_0.66_1.00_0.01/b4de10_e9046af4a94b4fe6b05bea2c7bbff320~mv2.webp",
        "content": "How do you encapsulate the enigma of Shane Warne in a way in which hasn’t been done before? The adjectives fall short for the man who became synonymous with leg-spin bowling, ever since his emergence in the 90’s. The 23-year-old began with a forgettable debut against India in Sydney in 1992, returning with figures of 228-1 in two tests. Speculations of dropping were rife and the future uncertain.\nWarne was a natural in many ways - big hands, strong wrists and a poetic action. With able guidance and mentorship from former Australian spinner Terry Jenner, he took on the mantle to increase the weapons in his armory and emerge as the best version of himself. The first signs of what was to come were visible when Warne cleaned up Richie Richardson with his yet to become famous flipper during the West Indies tour of Australia in 1993.\nAnd then the 1993 Ashes happened. Warne’s first ball in the Ashes dismissing Mike Gatting not only bamboozled Gatting and everyone on the field but forced the entire world to take notice. The ball that turned viciously after pitching outside leg stump and hitting the top of off-stump came to be famously regarded as the ‘Ball of the Century’. Cricket had found a gem. Warne never looked back.\nWarnie, as he was affectionately known, was an attention-grabbing performer. Every ball was a theatre with ample drama, suspense and excitement. In 1995, Australia and Pakistan locked horns for a three test series. The third day of the final test was about to close when Warne was introduced to bowl the ultimate over of the day. Facing him was Basit Ali.\nAli was notoriously known to hold up the game. He would randomly indulge in tying up laces or calling for gloves. It was the last ball of the day and Warne decided to give it back to Ali. He called up the wicket-keeper Healey, and the duo were engaged in a lengthy conversation (apparently deciding their dinner plans) to disturb Ali’s rhythm and prompt him to make a mistake. The plot worked. Warne bowled into the rough and the ball ripped through Ali’s legs to dismantle the stumps as he tried to kick it away. Classic Shane!\nHis intimidating personality and attacking mindset was at display during India’s tour of Australia in 1999. In the first test at Adelaide, he noticed that Ganguly was comfortably blocking his deliveries. On finding the first opportunity, he uttered to Ganguly, “Hey mate, these 40,000 people haven’t come to see you kick the ball, they’ve come to see this bloke playing shots (referring to Sachin, who was at the non-striker end).” This played on Ganguly’s mind as he attempted to come down the track to hit Warne and was stumped.\nWarne’s craft was unparalleled and so was his understanding of the game. In the second innings of the Trent Bridge Test of the 2001 Ashes, Mark Ramprakash was grinding hard to defy Australia’s first innings lead and take England to a match-winning total. The psychologist in Shane Warne was aware about Mark’s intentions and started instigating him to charge down the track to hit him. “Come on, Ramps, you know you want to”, Warne said. Mark couldn't avoid the temptation and was stumped by Gilchrist after he was left stranded by the trademark Warne leg break, handing Australia a win in a low-scoring encounter.\nWarne came to become an exuberant cricketer, whose charisma and personality was universally loved and celebrated. His opponents respected him and the fans wanted to see him deploy his art, even if it was against their home team. That is perhaps because he mastered the toughest known craft in the game of cricket. If I ever get my hands on a time machine, I would go back to witness Shane Warne dipping, drifting and spinning the ball - in a way in which only he could do."
    },
    {
        "id": "valentine-day-miracle",
        "title": "The Valentine's Day Miracle",
        "author": "Lakshit Singhal",
        "date": "Feb 14",
        "readTime": "2 min read",
        "category": "History",
        "coverColor": "bg-pink-900",
        "spineColor": "bg-pink-950",
        "textColor": "text-pink-50",
        "coverImage": "https://static.wixstatic.com/media/b4de10_e29c333deb23487693232bcbe82e90db~mv2.jpg/v1/fill/w_800,h_800,al_c,q_85/b4de10_e29c333deb23487693232bcbe82e90db~mv2.jpg",
        "content": "Talking about the memorable cricket moments on Valentine's Day, it's hard to beat George Lohmann's takedown of the South Africa side in 1896.\n\nA medium-pace bowler, Lohmann was arguably one of the greatest bowlers of the 19th century. His stats are mind-numbing. He took 112 wickets in 18 Tests at an average of 10.75 and strike rate of 34.\n\nEngland toured South Africa for a three-match test series in 1896. South Africa was still finding its feet in international cricket and this became evident in the first test at Port Elizabeth which the English won by 288 runs. Lohmann took 7 for 38 in the first innings followed by 8 for 7 in the second innings, including a hat-trick to finish the match.\n\nThe second test began at Johannesburg on March 2. Wait, wasn't this story about Valentine's Day? Yes. The second test at Johannesburg started on March 2, but the first test at Port Elizabeth ended on... February 14.\n\nSo on Valentine's Day, 1896, George Lohmann produced one of the most remarkable bowling performances in Test history: 9.4-5-7-8, including a hat-trick to wrap up the match. South Africa was bowled out for 30 in the second innings."
    },
    {
        "id": "pepsi-vs-coke-1996",
        "title": "Pepsi vs Coca-Cola: Most Heated Clash of the 1996 World Cup",
        "author": "Lakshit Singhal",
        "date": "Jan 25",
        "readTime": "3 min read",
        "category": "History",
        "coverColor": "bg-sky-900",
        "spineColor": "bg-sky-950",
        "textColor": "text-sky-50",
        "coverImage": "https://static.wixstatic.com/media/b4de10_60c685d65a6c4f3e9f8e3d97ba44b57f~mv2.png/v1/fill/w_800,h_1000,al_c,q_90,usm_0.66_1.00_0.01/b4de10_60c685d65a6c4f3e9f8e3d97ba44b57f~mv2.png",
        "content": "The 1996 Cricket World Cup was the site of a major controversy between beverage giants Pepsi and Coca-Cola.\n\nCoca-Cola was the official sponsor of the 1996 World Cup, having paid around $4 million for the rights. This meant their branding was everywhere in the stadiums and official broadcasts.\n\nPepsi, however, wasn't going to sit quietly. They launched an \"ambush marketing\" campaign with the tagline \"Nothing official about it\". They roped in top cricketers like Sachin Tendulkar, Courtney Walsh, and Dickie Bird to feature in their ads, mocking the official nature of the tournament and suggesting that the real fun was with the unofficial drink, Pepsi.\n\nThe campaign was a massive success. \"Nothing official about it\" became a catchphrase. Coca-Cola was left fuming as Pepsi stole the limelight despite not being the official sponsor. It became a classic case study in marketing textbooks about how to hijack a competitor's event sponsorship."
    },
    {
        "id": "english-frontier",
        "title": "The English Frontier: In Pursuit of Perfection",
        "author": "Lakshit Singhal",
        "date": "May 2021",
        "readTime": "4 min read",
        "category": "History",
        "coverColor": "bg-green-900",
        "spineColor": "bg-green-950",
        "textColor": "text-green-50",
        "coverImage": "https://static.wixstatic.com/media/b4de10_0e66694a169a4f7aa08d63a62d86847b~mv2.webp/v1/fill/w_1000,h_666,al_c,q_85,usm_0.66_1.00_0.01/b4de10_0e66694a169a4f7aa08d63a62d86847b~mv2.webp",
        "content": "When Virat’s troops landed on English soil in May 2021, the quest was not limited to being the first-ever World Test Champions. Yes, that was the bigger of the two goals. But the team was equally determined to regain the Pataudi Trophy that has evaded India since 2007. The wounds of 4-1 drubbing in 2018 were still fresh and the WTC final loss to New Zealand added to the team's woes. Add to that the precarious situation of functioning in bio-bubbles due to the deadly Covid-19 outbreak.\n\nThe visitors started well by taking a lead in the first test at Nottingham, but rains played spoilsport. They then famously conquered the Lord's to take a 1-0 lead. A massive defeat at Headingley leveled the series. The caravan then moved to Oval. Rohit Sharma's first overseas test hundred, Shardul Thakur's twin fifties and a masterful bowling performance on the final day gave India a 2-1 lead. It seemed that the fortress was finally breached.\n\nBut Covid-19 had the final say. The Manchester test was cancelled hours before the toss due to an outbreak in the Indian camp. The series remained unfinished at 2-1. It was only fitting that the rescheduled fifth test was played in 2022 to decide the fate of the trophy. India lost that match but the 2-2 draw meant they retained the Pataudi Trophy.\n\nThis series will be remembered for the high quality cricket on display. It was a battle of attrition, skill and temperament. The fast bowlers from both sides were simply relentless. Rohit Sharma finally proved his metteleness as a test opener in swinging conditions. KL Rahul made a grand comeback. Joe Root was in the form of his life. And Jasprit Bumrah - well, he is just a genius."
    },
    {
        "id": "two-tests",
        "title": "Two Tests",
        "author": "Lakshit Singhal",
        "date": "Aug 17",
        "readTime": "3 min read",
        "category": "Match Report",
        "coverColor": "bg-gray-800",
        "spineColor": "bg-gray-900",
        "textColor": "text-gray-100",
        "coverImage": "https://static.wixstatic.com/media/b4de10_01bc5e254f8b4cd7bb7d488ea4d8d4f2~mv2.webp/v1/fill/w_1000,h_667,al_c,q_85,usm_0.66_1.00_0.01/b4de10_01bc5e254f8b4cd7bb7d488ea4d8d4f2~mv2.webp",
        "content": "When Ajaz Patel boarded the flight to India, little did he know that he would be returning as a member of the coveted ‘10 wickets in an innings’ club. Only the third bowler after Jim Laker and Anil Kumble to have achieved the magnanimous feat, Patel’s homecoming is now etched in cricket folklore.\n\nKanpur was host to the first test. The effects of climate change strongly made its presence felt. As if rain disruptions were not enough, the gloomy, polluted and smoke-filled weather is not too far behind in being a major impediment in organizing cricket. But this was overshadowed by a thrilling last-ball draw on the fifth day, the first in Kanpur’s cricket history.\n\nThe New Zealand tour was Rahul Dravid’s first assignment as the head coach. It was heartening to see him reinstate the culture of retired players handing debut caps to the debutantes. I wonder why this tradition was stopped in the first place.\n\nThe contest between the top two ranked teams was riveting - a fight till the lights went out on the final day. In the absence of Kohli, Shreyas Iyer made his presence felt - becoming the only Indian to score a century and a half-century on debut.\n\nThe action moved to Mumbai after the nail-biting Kanpur Test. As Virat Kohli returned, so did the flair and flamboyance. It was absolute domination from Day 1. Mayank’s majestic 150 provided momentum and the bowlers took care of the rest. The Kiwis were without Williamson and it certainly had an impact. They were bundled for 62 in the first innings and could never recover, eventually losing by 372 runs.\n\nThe match, or rather the two tests, were eclipsed by an astounding feat by the Mumbai born Kiwi spinner Ajaz Patel. He took all of 10 Indian wickets in the first innings. Ajaz lacked consistency but bowled with excellent control and variation. It was like a chapter of dreams unfolding in a fairytale."
    },
    {
        "id": "review-rise-of-hitman",
        "title": "Review: The Rise Of The Hitman",
        "author": "Lakshit Singhal",
        "date": "Jul 4",
        "readTime": "3 min read",
        "category": "Book Review",
        "coverColor": "bg-purple-900",
        "spineColor": "bg-purple-950",
        "textColor": "text-purple-50",
        "coverImage": "https://static.wixstatic.com/media/b4de10_c756c1cb1d0d4cff9aba1a1519d12d0d~mv2.jpg/v1/fill/w_799,h_1000,al_c,q_85,usm_0.66_1.00_0.01/b4de10_c756c1cb1d0d4cff9aba1a1519d12d0d~mv2.jpg",
        "content": "The rise of the hitman maps the journey of one of India's most accomplished cricketers. Kaushik explores the character behind the cricketer. Personality behind the human being. And he succeeds for the most part. He shares how Rohit once forgot his wedding ring - an attribute that has been infamously attached to his name.\n\n“People think his cover drive or his pull shot is one of his greatest strengths. But his greatest strength is his ability to bounce back from setbacks”, says Dinesh Karthik. Rohit didn't have it easy. He had to fight untimely injuries and wait for his opportunity. But he persisted.\n\nThe eureka moment came in 2013 when the duo of Dhoni and Fletcher catapulated him as the opener. This was followed by a remarkable partnership with Dhawan in the Champions Trophy. He not only made that position his own but did it with flair and flamboyance.The book does not shy in giving credit to Dhoni, Kohli and Shastri who played a career-altering role in shaping Rohit's career.\n\nRohit is only the second captain after MSD to have led the team to two ICC titles. He also has 5 IPL trophies to his credit. There is a full chapter dedicated to his captaincy. How he has bridged the gap between seniors and juniors is something we have all been witness to. The T20 World Cup win in 2024 stands tall in Rohit's glorious career and Kaushik triumphs in detailing the emotions.\n\nThe author assembles a cast of cricketers and coaches to add heft to the narrative. Yuvraj, DK, Ganguly, Laxman, WV Raman, Dravid and several others - each one has a Rohit story to share. While this enhances the storytelling and makes the book engaging, it sometimes becomes repetitive and tiresome.\n\nBut there is a bigger problem. Most of the book is a recollection of events, facts and statistics. The narrative oscillates between the landmark moments of Rohit's career. It stops celebrating the story and instead focuses on the events. Kaushik’s writing helps it thrive but there is very little to hold my interest.\n\nVerdict:\nIn conclusion, if you are a Rohit fan, this book will delight you. For a neutral and a non-cricket fan, there is little here to keep you captivated."
    },
    {
        "id": "sri-lanka-cricket-museum",
        "title": "A Celebration of Sri Lanka and its cricket",
        "author": "Lakshit Singhal",
        "date": "May 15",
        "readTime": "4 min read",
        "category": "Travel",
        "coverColor": "bg-yellow-800",
        "spineColor": "bg-yellow-900",
        "textColor": "text-yellow-50",
        "coverImage": "https://static.wixstatic.com/media/b4de10_22c898a768f7441387c3c2ddb3b22c84~mv2.jpg/v1/fill/w_753,h_1000,al_c,q_85,usm_0.66_1.00_0.01/b4de10_22c898a768f7441387c3c2ddb3b22c84~mv2.jpg",
        "content": "It was my last day in the Island Nation. As the sun set on my vacation, I was preparing to go back with an unfulfilled dream. Even though I had managed to visit the Galle cricket stadium, a few other cricket grounds and libraries where I could get cricket books from were left to be covered. If you don't know this about me, I love collecting cricket books, reading about the history of the game and visiting various stadiums across the world. I believe cricket, culture and community go together and this is my way of connecting with the game.\n\nI somehow managed to sneak in some time before my flight. Colombo is hot and humid. Slightly busy too. But that didn't deter me from taking a ride to the Sinhalese Sports Club (SSC) cricket ground. I went with the anticipation of seeing the iconic ground which is referred to as the 'Lord's of Sri Lanka' and has hosted landmark matches, such as Sri Lanka's inaugural Test in 1984.\n\nWhen I reached there, I noticed a big entrance just adjacent to the stadium entrance that read \"Sri Lanka Cricket Museum\". A Museum? When all I want to see is the iconic stadium.\n\nCuriosity takes over and I ask the guard if it is open to visitors. They allow me after paying an entry fee. As I opened the gate and took the first step inside, I felt a shift in energy. The place breathed cricket. I haven't been to many places like this. I have been to World Cup games. I have also been to a World Cup Final in Ahmedabad. Being in a stadium with thousand of fans is a pulsating experience. But this was something else. Both are equally rewarding. But this felt more personal and enriching.\n\nI stood in awe and tried to gather my emotions. Was this the Trophy that Ranatunga and his men lifted in 1996? The T20 World Cup 2014 Trophy also stood there in all its glory. In fact, both the World Cup(s) have a dedicated corner along with the pictures, jersey, scorecard and signed bats.\n\nThe museum was opened in 2019. It is not vast but keeps you captivated. It is thoughtfully designed with prominence given to the hallmark achievements of Sri Lanka Cricket. The two World Cup Trophies take the center stage, obviously.\n\nAt the entrance, we get to see a timeline of Sri Lanka cricket, reminding the fans of all the glorious moments in Sri Lanka cricket history. As we move in, the memorabilia, photos and artifacts start weaving their magic. The museum celebrates Sri Lankan cricket in its most purest form."
    },
    {
        "id": "review-tested-pat-cummins",
        "title": "Review: Tested by Pat Cummins",
        "author": "Lakshit Singhal",
        "date": "May 8",
        "readTime": "2 min read",
        "category": "Book Review",
        "coverColor": "bg-teal-900",
        "spineColor": "bg-teal-950",
        "textColor": "text-teal-50",
        "coverImage": "https://static.wixstatic.com/media/b4de10_59b48f2cb5a54f86b3106a5e486fd276~mv2.jpg/v1/fill/w_750,h_1000,al_c,q_85,usm_0.66_1.00_0.01/b4de10_59b48f2cb5a54f86b3106a5e486fd276~mv2.jpg",
        "content": "Pat Cummins is inarguably the most dynamic leader in world cricket right now. He is sharp, reads and understands the game well and is a master in executing the game plans.\n\nLet's set the record straight. Tested is not his autobiography. Neither does it claim to be one. It is more of a self-help and motivational book. Cummins interviews eleven accomplished personalities - individuals from different walks of life. Podcaster, business magnates, media and film personalities, politicians etc. A collection of wisdom, if I may say.\n\nIt must have taken painstaking efforts to get all the interviewees on board. Cummins and his team definitely deserves credit for putting together this one of a type initiative.\n\nThough each chapter has in-depth insights about the interviewee and the field they operate in, I found the conversations with Julia Gillard, Dennis Lillee and Ronnie Screwvala to be interesting. Particularly the one with Dennis Lillee. The chapter offers deep insights about the World Series cricket and how it revolutionized cricket in the late 90’s.\n\nIt talks about change, innovation and adaptability. Cummins has taken the opportunity to talk about his injury struggles throughout the career and how Deniss the coach has helped him develop a sustainable bowling action. It’s rightly titled “Amateurs try, professionals prepare and adapt”.\n\nThe aim is to help the readers become better leaders. Cummins brings in spice by adding cricket references and sharing insights from his own cricketing journey in between the chapters to drive the point more effectively. The diversity of stories makes for an enriching read.\n\nThrough the book, Pat reflects on the major moments that have shaped his life, both personally and professionally.\n\nThis also means this is not your conventional cricket book. So if you are coming with that expectation, you would want to look somewhere else. I hope that he accomplishes a lot more in the years to come and will wait for him to write a memoir some day."
    }
]